"""
На клетчатой бумаге Петя нарисовал отрезок из точки с координатами (a, b) в точку с координатами (c, d).
Через сколько клеток проходит этот отрезок (считается, что отрезок проходит через клетку,
если он проходит через ее внутренность, если же он проходит только через вершину или по границе клетки,
считается, что он не проходит через клетку).

Входные данные:
Вводятся целые числа a, b, c, d.

Выходные данные:
Выведите одно числоа - количество клеток, через которые проходит отрезок

Примеры:
Вход 1
0 0 6 4
Выход 1
8

Вход 2
3 3 -3 3
Выход 2
0
"""
